{
    "current": {
        "characters": {
            "main": {
                "John Mush": [
                    "John Mush is a main character in this story.",
                    "John is a cunning, manipulative, murderous 28-year-old man. He has black hair, blue eyes, and an intimidating face.",
                    "Attributes:",
                    " - Raw strength: Greatly above average. Lean in physique, John rivals ",
                    " - Stamina: Greatly above average. John can fight dozens of soldiers single-handedly without exhausting.",
                    " - Combat abilities: Extremely high. Thanks to his calm and collected personality, John has trained his close-quarters combat abilities and ranged combat abilities for nearly his whole life. He is the best melee fighter and among the top sharpshooters in the Rebel Force.",
                    " - Intelligence: High. Whether caused by his personality or vice versa, John's strategic and tactical intelligence is second to none among the Rebel Force.",
                    " - Emotional Intelligence: Average. John's manipulative abilities stem mostly from his high analytical intellect, rendering him severely below average when it comes to receiving and displaying emotions. His brother Paul has tried to help him properly understand human emotion over the years.",
                    "Relations:",
                    " - Paul Mush: John's brother and best friend. Paul and John have been extremely close friends from childhood. Paul knows about John's manipulative behavior and has helped him control it. They both trust each other with their lives.",
                    " - Amy Harrison: John's main researcher, engineer, and close friend. Even with John's manipulative personality, he fully trusts Amy, and Amy trusts him.",
                    "Position:",
                    " - Rebel Force (Rebels): The organization John founded to fight against the Subterraneans. John currently leads the Rebels for his own benefit to survive against the Subterraneans.",
                    " - Subterraneans (STs): Enemy",
                    "Important deeds:",
                    " - Founded Rebel Force after The First Incursion to fight against Subterraneans.",
                    " - Has eliminated several human organizations deemed as threats, i.e. The Golden Samurai.",
                    " - Has saved his brother Paul and Angelina two times against sudden Subterranean attacks.",
                    " - Has killed 139 people singlehandedly, garnering him a ruthless and brave reputation."
                ],
                "Amy Harrison": [
                    "Amy Harrison is a main character in this story.",
                    "Amy is a brilliant scientist and engineer, contributing to all of the revolutionary tech the Rebels use to defend against and fight the Subterraneans.",
                    "Relations:",
                    " - John Mush"
                ]
            },
            "misc": {
                "secondary": [
                    "Paul Mush is a secondary character in this story.",
                    "Paul is a gentle, kind-hearted, charismatic 24-year-old man. He has black hair, blue eyes, and an intimidating face despite his gentle personality.",
                    "Attributes:",
                    " - Raw strength: Above average. Paul recently broke his leg from a cave-in during The Mush Offensive.",
                    " - Stamina: Greatly above average. Paul can withstand carrying large concrete tiles above his head for hours.",
                    " - Combat abilities:",
                    " - Intelligence: Slightly above average.",
                    " - Emotional Intelligence: Greatly above average. Paul understands people's emotions instantly upon seeing them, can detect lies, is extremely influential.",
                    "Relations:",
                    " - John Mush: Paul's brother and best friend.",
                    " - Amy Harrison: John's close associate in the Rebel Force.",
                    "",
                    "Angelina Washington is a secondary character in this story.",
                    "Angelina is a manipulative, psychopathic 32-year-old woman. She has white hair, golden eyes, and an innocent-seeming face.",
                    "Relations:",
                    " - John Mush: Angelina's Rebel associate. Angelina despises John for killing her brother during The First Incursion. Still, she pretends to be his associate to gain information about the Rebels.",
                    " - Paul Mush: Angelina's unrequited love. Paul once saved Angelina during The Second Incursion."
                ],
                "side": [
                    "Harry Washington was Angelina's brother. He was killed by John Mush in The First Incursion."
                ]
            }
        }
    },
    "events": {
        "The First Incursion": [
            "The First Incursion took place from September 5th, 2027 to September 8th, 2027. It was a catastrophic event in human history, wiping out nearly 90% of human life. It was an organized ambush by Subterraneans in an attempt to reclaim territory from millenia ago.",
            "Notable moments during The First Incursion are:",
            " - The world-wide earthquakes and sudden eruptions in the ground. The rich, poor, weak, and strong were killed equally.",
            " - Harry Washington's death by John Bush's hands during the second day of the attack. ",
            " - ",
            "",
            "",
            "",
            ""
        ],
        "The Second Incursion": [
            "The Second Incursion took place from August 18th, 2028 to September 11th, 2028. Spanning longer than the previous Incursion, it was an all-out war between humans and Subterraneans, wiping out nearly 80% of both sides' forces. It originally started out as a Subterranean ambush, but the Rebels were able to launch an extremely effective counter-offensive.",
            "Thanks to the Rebels' ingenious technology, it ended in a stalemate with all forces retreating, after the Rebels successfully destroyed a newly-formed Subterranean city on previously Brazilian territory.",
            "Unfortunately, there were still many casualties. Squadron 2 sacrificed themselves completely as a decoy, Paul Mush broke his leg due to a cavein, etc."
        ],
        "The Mush Offensive": [
            "The Mush Offensive took place in two parts, November 9th, 2028 to November 18th, 2028 and January 9th, 2029 to January 20th, 2028.",
            "Following John Mush's genius strategic mind, the first part of The Mush Offensive was an espionage attack, retrieving information from inside the capital Subterranean city Aseemok—previously Canadian territory before The First Incursion—and planting hi-tech hacking devices created by Amy Harrison all over core powerplants.",
            "The second part of The Mush Offensive included the activation of said devices as a devastating blow to Aseemok's infrastructure, as well as a distraction for an ambush by the humans."
        ]
    }
}