{
    "current": {
        "subjects": {
            "characters": {
                "user": "John Mush",
                "main": {
                    "John Mush": [
                        "John Mush is a main character in this story.",
                        "John is a cunning, manipulative, murderous 28-year-old man. He has black hair, blue eyes, and an intimidating face.",
                        "Relations:",
                        " - Paul Mush: John's brother and best friend. Paul and John have been extremely close friends from childhood. Paul knows about John's manipulative behavior and has helped him control it. They both trust each other with their lives.",
                        " - Amy Harrison: John's main researcher, engineer, and close friend. Even with John's manipulative personality, he fully trusts Amy, and Amy trusts him.",
                        "Position:",
                        " - Rebel Force (Rebels): The organization John founded to fight against the Subterraneans. John currently leads the Rebels for his own benefit to survive against the Subterraneans.",
                        " - Subterraneans (STs): Enemy",
                        "Important deeds:",
                        " - Founded Rebel Force after First Incursion to fight against Subterraneans.",
                        " - Has eliminated several human organizations deemed as threats, i.e. The Golden Samurai.",
                        " - Has saved his brother Paul and Angelina two times against sudden Subterranean attacks.",
                        " - Has killed 139 people singlehandedly.",
                        "",
                        "",
                        ""
                    ],
                    "Paul Mush": [
                        "Paul Mush is a main character in this story.",
                        "Paul is a gentle, kind-hearted 24-year-old man. He has black hair, blue eyes, and an intimidating face. ",
                        "Relations:",
                        " - John Mush: Paul's brother and best friend.",
                        " - Amy Harrison: John's close associate in the Rebel Force.",
                        ""
                    ],
                    "Amy Harrison": [
                        "Amy Harrison is a main character in this story.",
                        "Amy is a brilliant scientist and engineer, contributing to all of the revolutionary tech the Rebels use to defend against and fight the Subterraneans.",
                        "Relations: ",
                        " - John Mush",
                        "",
                        "",
                        "",
                        ""
                    ],
                    "Angelina Washington": [
                        "Angelina is a secondary character in this story.",
                        "Angelina is a manipulative, psychopathic 32-year-old woman. She has white hair, golden eyes, and an innocent-seeming face.",
                        "Relations:",
                        " - John Mush: Angelina's Rebel associate. Angelina despises John for killing her brother during the First Incursion. Still, she pretends to be his associate to gain information about the Rebels.",
                        " - Paul Mush: Angelina's unrequited love. Paul onced saved Angelina",
                        "",
                        "",
                        ""
                    ]
                },
                "misc": {
                    "secondary": [
                        "Sonya Lopez is ",
                        "",
                        "",
                        "",
                        "",
                        ""
                    ],
                    "side": [
                        "Harry Washington was Angelina's brother. He was killed by John Mush in the First Incursion.",
                        "",
                        "",
                        "",
                        "",
                        ""
                    ]
                }
            }
        }
    },
    "time": {
        "Day 1": {
            "John Mush": [

            ]
        }
    }
}